## Quiz #0203

In [ ]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [ ]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [ ]:
df = pd.read_csv('data_sales.csv', header='infer')

In [ ]:
df.shape

(43, 5)

In [ ]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [ ]:
df['Amount'] = df['UnitPrice'] * df['Units']
df.head(10)

          Date   Region     Item  UnitPrice  Units   Amount
0   4-Jul-2014     East  Pen Set       4.99     62   309.38
1  12-Jul-2014     East   Binder       1.99     29    57.71
2  21-Jul-2014  Central  Pen Set      12.49     55   686.95
3  29-Jul-2014     East   Binder      19.99     81  1619.19
4   7-Aug-2014  Central  Pen Set      23.95     42  1005.90
5  15-Aug-2014     East   Pencil       4.99     35   174.65
6  24-Aug-2014     West     Desk     275.00      3   825.00
7   1-Sep-2014  Central     Desk     125.00      2   250.00
8  10-Sep-2014  Central   Pencil       1.29      7     9.03
9  18-Sep-2014     East  Pen Set      15.99     16   255.84

2). Average unit price for each region. Use the groupby() method.

In [ ]:
df['UnitPrice'].groupby(df['Region']).mean()

Region
Central    18.018750
East        9.143846
West       53.658333
Name: UnitPrice, dtype: float64

3). Average unit price for each region. Use the pivot_table() method.

In [ ]:
df.pivot_table(values = ['UnitPrice'] , index = 'Region' , aggfunc = 'mean')

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [ ]:
df[['UnitPrice' , 'Units']].groupby(df['Region']).mean()

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [ ]:
df.pivot_table(values = ['UnitPrice' , 'Units'] , index = 'Region' , aggfunc = 'mean')

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [ ]:
df.pivot_table(values=['Units'] , index = 'Region',columns = ['Item'] , aggfunc = 'sum' , fill_value = 0)

         Units
Item    Binder Desk  Pen Pen Set Pencil
Region
Central    424    7   27     243    498
East       234    0  175     152    130
West        64    3   76       0     88

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [ ]:
df.pivot_table(values=['Amount'] , index = 'Region',columns = ['Item'] , aggfunc = 'sum' , fill_value = 0)

          Amount
Item      Binder Desk      Pen  Pen Set   Pencil
Region
Central  5762.63  875   539.73  2421.39  1540.32
East     2535.66    0  1354.25  1748.48   363.70
West     1279.36  825   151.24     0.00   231.12